pointers.org
:PROPERTIES:
:ID:       8c3a016e-bcb2-4181-a94d-6e7cb923c55c
:END:
#+title: Pointers
#+OPTIONS: toc:nil

[[id:9a465709-df21-4e37-9c16-efd2e9244729][ECGR2104: Notes]]

* Defintion
*Pointer:* a variable that stores the memory of another variable
#+begin_src cpp
int x = 10;
int* p = &x;
#+end_src
#+begin_quote
the above allows for us to store the memory location of x on p
#+end_quote
* Properties
*Declaration*

+ *int*___*     // Is used to emphasize that the variable being declared is a pointer of some type (i.e. int, double, short)

+ *= &___*   // Returns/pulls the memory address of a specific variable

#+begin_quote
In combination *int*p = &x;* returns the address of x and stores it within p
#+end_quote
*The Dereference Operator* (*)
#+begin_src cpp
#include <iostream>
using namspace std;

int x = 10;
int* p = &x; //*p = x = 10
cout << *p; //outputs 10
#+end_src
#+begin_quote
The "dereferenced" *p* can now reassign *x* in the opposite way as well; as they share the same address.
#+end_quote
#+begin_src cpp
int x = 10;
int* p = &x; // *p = x = 10
*p = 15;    // *p = 15 = x
#+end_src
